Terraform Plan:

```
oci_identity_compartment.k8s: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa4bbfmz332ypqxr6icuitp54jj7czdp4qliuo575ytuqakppgtmra]
module.virtual_network.oci_core_vcn.vcn["vcn1"]: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaic6ifviaeoaecu6uwycqmey7fx557mpjsj2cq2m35l5czm66to6a]
module.virtual_machine.data.oci_identity_availability_domains.ads: Reading...
module.virtual_machine.data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-2220574233]
module.virtual_network.oci_core_network_security_group.nsg["vcn1"]: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa]
module.virtual_network.oci_core_internet_gateway.igw["vcn1"]: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaatkiuijvp3iqbqnkdtznubouu2tg2verx24tgajrkoh5kh4znr7sa]
module.virtual_network.oci_core_route_table.rt["vcn1"]: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaayo35y4z5ptradj66364ykxoqytm6mfnqfahiwboyevwscpq4zf3a]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"]: Refreshing state... [id=F9258D]
module.virtual_network.oci_core_subnet.subnet["subnet1"]: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq]
module.virtual_machine.oci_core_instance.vm["test2"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicl3wfex656gf5z7rlzm7stckmvmbrofjf5rcfcf7eizwq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.virtual_machine.oci_core_instance.vm["control1"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "control1"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa",
            ]
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq"
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_machine.oci_core_instance.vm["control2"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "control2"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa",
            ]
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq"
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_machine.oci_core_instance.vm["test2"] will be destroyed
  # (because key ["test2"] is not in for_each map)
  - resource "oci_core_instance" "vm" {
      - availability_domain  = "YnJT:EU-FRANKFURT-1-AD-3" -> null
      - boot_volume_id       = "ocid1.bootvolume.oc1.eu-frankfurt-1.abtheljta523xmrj6v4nhlvyqkqcxvgisk767mnwledliflumexl375inoga" -> null
      - compartment_id       = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya" -> null
      - defined_tags         = {
          - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com"
          - "Oracle-Tags.CreatedOn" = "2023-06-02T14:14:02.270Z"
        } -> null
      - display_name         = "test2" -> null
      - extended_metadata    = {} -> null
      - fault_domain         = "FAULT-DOMAIN-1" -> null
      - freeform_tags        = {} -> null
      - id                   = "ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicl3wfex656gf5z7rlzm7stckmvmbrofjf5rcfcf7eizwq" -> null
      - image                = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq" -> null
      - is_cross_numa_node   = false -> null
      - launch_mode          = "PARAVIRTUALIZED" -> null
      - metadata             = {
          - "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        } -> null
      - preserve_boot_volume = false -> null
      - private_ip           = "10.1.1.251" -> null
      - public_ip            = "132.145.238.201" -> null
      - region               = "eu-frankfurt-1" -> null
      - shape                = "VM.Standard.E2.1.Micro" -> null
      - state                = "RUNNING" -> null
      - subnet_id            = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq" -> null
      - system_tags          = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> null
      - time_created         = "2023-06-02 14:14:03.075 +0000 UTC" -> null

      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      - create_vnic_details {
          - assign_private_dns_record = false -> null
          - assign_public_ip          = "true" -> null
          - defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/petr.nemec@gmx.com"
              - "Oracle-Tags.CreatedOn" = "2023-06-02T14:14:02.470Z"
            } -> null
          - display_name              = "test2" -> null
          - freeform_tags             = {} -> null
          - nsg_ids                   = [
              - "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa",
            ] -> null
          - private_ip                = "10.1.1.251" -> null
          - skip_source_dest_check    = false -> null
          - subnet_id                 = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq" -> null
        }

      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      - shape_config {
          - gpus                          = 0 -> null
          - local_disks                   = 0 -> null
          - local_disks_total_size_in_gbs = 0 -> null
          - max_vnic_attachments          = 1 -> null
          - memory_in_gbs                 = 1 -> null
          - networking_bandwidth_in_gbps  = 0.47999998927116394 -> null
          - nvmes                         = 0 -> null
          - ocpus                         = 1 -> null
          - processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> null
        }

      - source_details {
          - boot_volume_size_in_gbs = "47" -> null
          - boot_volume_vpus_per_gb = "10" -> null
          - source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq" -> null
          - source_type             = "image" -> null
        }
    }

  # module.virtual_machine.oci_core_instance.vm["worker1"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "worker1"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa",
            ]
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq"
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 1
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_machine.oci_core_instance.vm["worker2"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "worker2"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa",
            ]
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq"
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 1
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vm_public_ip = {
      + control1 = (known after apply)
      + control2 = (known after apply)
      - test2    = "132.145.238.201"
      + worker1  = (known after apply)
      + worker2  = (known after apply)
    }
```

Plan saved to GH artifacts.